<template>
	<view>
		<h1>用户协议</h1>
		<p>
			欢迎使用 Habeet 小程序（以下简称"本小程序"）。在使用本小程序之前，请您仔细阅读以下条款并同意遵守本协议。若您不同意本协议的任何内容，请您立即停止使用本小程序。
		</p>
		<h2>1. 用户行为规范</h2>
		<p>
			1.1 您在使用本小程序时应遵守相关法律法规，不得利用本小程序从事任何违法违规活动。<br>
			1.2 您应对自己在本小程序中的行为负责，包括但不限于自主设定标签、设定个人目标、参与积分奖励、兑换放松项目等。对于您通过本小程序进行的一切行为，您应承担相应的法律责任。
		</p>
		<h2>2. 权利声明</h2>
		<p>
			2.1 本小程序及其相关内容（包括但不限于文字、图片、图形、音频、视频等）的知识产权归本小程序所有，受到相关法律法规和国际条约的保护。<br>
			2.2 未经本小程序书面许可，您不得擅自复制、传播、展示、修改、创作衍生作品或以其他方式使用本小程序的内容。<br>
			2.3 您通过本小程序上传的个人信息和数据，您同意授予本小程序合理的使用权，用于提供服务、改进产品和开展市场活动，但不会公开或向第三方提供，除非经过您的明确授权或法律法规要求。
		</p>
	</view>
</template>

<script setup>

</script>

<style lang="scss">
	h1 {
		font-size: 48rpx;
		font-weight: bold;
	}

	h2 {
		font-size: 40rpx;
		font-weight: bold;
		margin-top: 40rpx;
	}

	p {
		margin-bottom: 20rpx;
	}
</style>